name: "image50"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00390625
    mirror: true
    crop_size: 100
  }
  data_param {
    source: "/path/to/your/traininglmdb"
    batch_size: 128
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00390625
    crop_size: 100
  }
  data_param {
    source: "/path/to/your/testinglmdb"
    batch_size: 32
    backend: LMDB
  }
}
layer {
  name: "cornercrop"
  type: "CornerCrop"
  bottom: "data"
  top: "upperleft"
  top: "upperright"
  top: "lowerleft"
  top: "lowerright"
  corner_crop_param {
    crop_size: 56
    position: "upperleft"
    position: "upperright"
    position: "lowerleft"
    position: "lowerright"
  }
}
layer {
  name: "concat"
  type: "Concat"
  bottom: "upperleft"
  bottom: "upperright"
  bottom: "lowerleft"
  bottom: "lowerright"
  top: "concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "conv11"
  type: "Convolution"
  bottom: "data"
  top: "conv11"
  param {
    name: "conv11_w"
    lr_mult: 1
  }
  param {
    name: "conv11_b"
    lr_mult: 2
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    group: 4
    stride: 1
    weight_filler {
      type: "msra"
      variance_norm: AVERAGE
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu11"
  type: "ELU"
  bottom: "conv11"
  top: "conv11"
  elu_param {
    alpha: 1
  }
}
layer {
  name: "conv12"
  type: "Convolution"
  bottom: "conv11"
  top: "conv12"
  param {
    name: "conv12_w"
    lr_mult: 1
  }
  param {
    name: "conv12_b"
    lr_mult: 2
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 4
    stride: 1
    weight_filler {
      type: "msra"
      variance_norm: AVERAGE
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu12"
  type: "ELU"
  bottom: "conv12"
  top: "conv12"
  elu_param {
    alpha: 1
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv12"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv21"
  type: "Convolution"
  bottom: "pool1"
  top: "conv21"
  param {
    name: "conv21_w"
    lr_mult: 1
  }
  param {
    name: "conv21_b"
    lr_mult: 2
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 4
    stride: 1
    weight_filler {
      type: "msra"
      variance_norm: AVERAGE
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu21"
  type: "ELU"
  bottom: "conv21"
  top: "conv21"
  elu_param {
    alpha: 1
  }
}
layer {
  name: "conv22"
  type: "Convolution"
  bottom: "conv21"
  top: "conv22"
  param {
    name: "conv22_w"
    lr_mult: 1
  }
  param {
    name: "conv22_b"
    lr_mult: 2
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    group: 4
    stride: 1
    weight_filler {
      type: "msra"
      variance_norm: AVERAGE
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu22"
  type: "ELU"
  bottom: "conv22"
  top: "conv22"
  elu_param {
    alpha: 1
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv22"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv31"
  type: "Convolution"
  bottom: "pool2"
  top: "conv31"
  param {
    name: "conv31_w"
    lr_mult: 1
  }
  param {
    name: "conv31_b"
    lr_mult: 2
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 4
    stride: 1
    weight_filler {
      type: "msra"
      variance_norm: AVERAGE
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu31"
  type: "ELU"
  bottom: "conv31"
  top: "conv31"
  elu_param {
    alpha: 1
  }
}
layer {
  name: "conv32"
  type: "Convolution"
  bottom: "conv31"
  top: "conv32"
  param {
    name: "conv32_w"
    lr_mult: 1
  }
  param {
    name: "conv32_b"
    lr_mult: 2
  }
  convolution_param {
    num_output: 768
    pad: 1
    kernel_size: 3
    group: 4
    stride: 1
    weight_filler {
      type: "msra"
      variance_norm: AVERAGE
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu32"
  type: "ELU"
  bottom: "conv32"
  top: "conv32"
  elu_param {
    alpha: 1
  }
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv32"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv41"
  type: "Convolution"
  bottom: "pool3"
  top: "conv41"
  param {
    name: "conv41_w"
    lr_mult: 1
  }
  param {
    name: "conv41_b"
    lr_mult: 2
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    group: 4
    stride: 1
    weight_filler {
      type: "msra"
      variance_norm: AVERAGE
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu41"
  type: "ELU"
  bottom: "conv41"
  top: "conv41"
  elu_param {
    alpha: 1
  }
}
layer {
  name: "conv42"
  type: "Convolution"
  bottom: "conv41"
  top: "conv42"
  param {
    name: "conv42_w"
    lr_mult: 1
  }
  param {
    name: "conv42_b"
    lr_mult: 2
  }
  convolution_param {
    num_output: 1024
    pad: 1
    kernel_size: 3
    group: 4
    stride: 1
    weight_filler {
      type: "msra"
      variance_norm: AVERAGE
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu42"
  type: "ELU"
  bottom: "conv42"
  top: "conv42"
  elu_param {
    alpha: 1
  }
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv42"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv51"
  type: "Convolution"
  bottom: "pool4"
  top: "conv51"
  param {
    name: "conv51_w"
    lr_mult: 1
  }
  param {
    name: "conv51_b"
    lr_mult: 2
  }
  convolution_param {
    num_output: 640
    pad: 1
    kernel_size: 3
    group: 4
    stride: 1
    weight_filler {
      type: "msra"
      variance_norm: AVERAGE
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu51"
  type: "ELU"
  bottom: "conv51"
  top: "conv51"
  elu_param {
    alpha: 1
  }
}
layer {
  name: "conv52"
  type: "Convolution"
  bottom: "conv51"
  top: "conv52"
  param {
    name: "conv52_w"
    lr_mult: 1
  }
  param {
    name: "conv52_b"
    lr_mult: 2
  }
  convolution_param {
    num_output: 1280
    pad: 1
    kernel_size: 3
    group: 4
    stride: 1
    weight_filler {
      type: "msra"
      variance_norm: AVERAGE
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool5"
  type: "Convolution"
  bottom: "conv52"
  top: "pool5"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 1280
    pad: 0
    kernel_size: 8
    group: 4
    stride: 1
    weight_filler {
      type: "msra"
      variance_norm: AVERAGE
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "drop"
  type: "Dropout"
  bottom: "pool5"
  top: "drop"
  dropout_param {
    dropout_ratio: 0.4
  }
}
layer {
  name: "slice_drop"
  type: "Slice"
  bottom: "drop"
  top: "drop11"
  top: "drop12"
  top: "drop21"
  top: "drop22"
  slice_param {
    slice_dim: 1
  }
}
layer {
  name: "fc11"
  type: "InnerProduct"
  bottom: "drop11"
  top: "fc11"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10575
    weight_filler {
      type: "msra"
      variance_norm: AVERAGE
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loss11"
  type: "SoftmaxWithLoss"
  bottom: "fc11"
  bottom: "label"
  top: "loss11"
  loss_weight: 1
}
layer {
  name: "accuracy11"
  type: "Accuracy"
  bottom: "fc11"
  bottom: "label"
  top: "accuracy11"
}
layer {
  name: "fc12"
  type: "InnerProduct"
  bottom: "drop12"
  top: "fc12"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10575
    weight_filler {
      type: "msra"
      variance_norm: AVERAGE
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loss12"
  type: "SoftmaxWithLoss"
  bottom: "fc12"
  bottom: "label"
  top: "loss12"
  loss_weight: 1
}
layer {
  name: "accuracy12"
  type: "Accuracy"
  bottom: "fc12"
  bottom: "label"
  top: "accuracy12"
}
layer {
  name: "fc21"
  type: "InnerProduct"
  bottom: "drop21"
  top: "fc21"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10575
    weight_filler {
      type: "msra"
      variance_norm: AVERAGE
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loss21"
  type: "SoftmaxWithLoss"
  bottom: "fc21"
  bottom: "label"
  top: "loss21"
  loss_weight: 1
}
layer {
  name: "accuracy21"
  type: "Accuracy"
  bottom: "fc21"
  bottom: "label"
  top: "accuracy21"
}
layer {
  name: "fc22"
  type: "InnerProduct"
  bottom: "drop22"
  top: "fc22"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10575
    weight_filler {
      type: "msra"
      variance_norm: AVERAGE
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loss22"
  type: "SoftmaxWithLoss"
  bottom: "fc22"
  bottom: "label"
  top: "loss22"
  loss_weight: 1
}
layer {
  name: "accuracy22"
  type: "Accuracy"
  bottom: "fc22"
  bottom: "label"
  top: "accuracy22"
}
